etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F3xx/STM32F3xx_I2C.cpp
			/* State which sets the stop bit */
			case STOP_CONDITION_ACK:
				if ( ( true == static_cast<bool_t>( ( Get_SR1() & I2C_SR1_BTF ) ) ) ||
					 ( true == static_cast<bool_t>( ( Get_SR1() & I2C_SR1_TXE ) ) ) )
				{
					Get_SR2();
					state_machine = MAX_STATE_ACK;
					m_i2c->CR2 &= ~( I2C_CR2_ITERREN | I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN );
					Set_Stop();
					Exchange_Complete( false );
				}
				break;

			case SET_COMMAND_ACK:

			case MAX_STATE_ACK:

			default:
				break;

		}
	}
	/* In case the transfer is through DMA */
	else
	{
		switch ( state_machine )
		{	/* State for sending device address/ start frame ACK */
			case START_STATE_ACK:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_SB ) )
				{
					Get_SR2();
					if ( device_address < 0x7FU )
					{
						m_i2c->DR = static_cast<uint16_t>
							( ( device_address << 1U ) /* | 0x00U */ );
						state_machine = SET_DEVICE_ADDRESS_ACK;
					}
					else if ( ( device_address > 0x7FU ) && ( device_address < 0x3FFU ) )
					{
						i2c_address = ( ( device_address >> 8U ) & 0x03U );
						i2c_address = static_cast<uint16_t>( i2c_address << 1 );
						m_i2c->DR = ( ADDR_HEADER_10_BIT | i2c_address /* | 0x00U */ );
						state_machine = SET_ADDRESS_BYTE_2;
					}
					else
					{
						state_machine = MAX_STATE_ACK;
						Exchange_Complete( false );
					}
				}
				break;

			/* Send upper byte of an address in case of 10 bit addressing mode */
			case SET_ADDRESS_BYTE_2:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_ADD10 ) )
				{
					Get_SR2();
					i2c_address = device_address & 0xFFU;
					m_i2c->DR = i2c_address;
					state_machine = SET_DEVICE_ADDRESS_ACK;
				}
				break;

			/* Device address Acknowledge state. Also used for initiating DMA transfer */
			case SET_DEVICE_ADDRESS_ACK:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_TXE ) )
				{
					Get_SR2();
					if ( transaction == I2C_WRITE_EXCHANGE )
					{
						state_machine = MAX_STATE_ACK;
					}
					else
					{
						state_machine = REPEAT_DEVICE_ADDRESS_ACK;
					}
					m_i2c->CR2 &= ~( I2C_CR2_ITERREN | I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN );
					m_tx_stream->CR |= DMA_SxCR_EN;
					/* Set TX DMA for Write Mode
					   Set TX DMA in Read Mode*/
					/* If Write mode statemachine will goto MAX State as STOP will be handled inside
					   DMA TX ISR */
					/* If Read mode statemachine will goto REPEAT_ADDRESS STATE as repeated start
					   shall be handled from DMA TX ISR*/
				}
				break;

			/* Repeat Device address in case of I2C read mode */
			case REPEAT_DEVICE_ADDRESS_ACK:
				if ( true == static_cast<bool_t>( Get_SR1() & I2C_SR1_SB ) )
				{
					Get_SR2();
					/* Diasbale RX DMA here Disable I2C interrupts */
					m_i2c->CR2 &= ~( I2C_CR2_ITERREN | I2C_CR2_ITEVTEN | I2C_CR2_ITBUFEN );
					m_i2c->CR2 |= I2C_CR2_LAST;
					m_rx_stream->CR |= DMA_SxCR_EN;
					if ( m_rx_length == 1U )
					{
						m_i2c->CR1 &= ( ~I2C_CR1_ACK );
					}

					if ( device_address < 0x7FU )
					{
						m_i2c->DR =
							( ( static_cast<uint16_t>( device_address << 1U ) ) | 0x01U );
						Wait_Flag_Timeout( I2C_SR1_ADDR );
					}
					else if ( ( device_address > 0x7FU ) && ( device_address < 0x3FFU ) )
					{
						i2c_address = ( ( device_address >> 8U ) & 0x03U );
						i2c_address = static_cast<uint16_t>( i2c_address << 1 );
						m_i2c->DR = ( ADDR_HEADER_10_BIT | i2c_address | 0x01U );
						Wait_Flag_Timeout( I2C_SR1_ADDR );
					}
					else
					{
						Exchange_Complete( false );
					}
					state_machine = RECEIVE_DATA_ACK;
				}
				Get_SR2();
				break;

			/* The below cases will not be used. But are defined here to suppress MISRA */
			case SET_COMMAND_ACK:

			case REPEATED_START_STATE_ACK:

			case SEND_DATA_ACK:

			case RECEIVE_DATA_ACK:

			case STOP_CONDITION_ACK:

			case MAX_STATE_ACK:

			default:
				break;

		}
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F3xx_I2C::Assume_IO_Control( const uC_BASE_I2C_IO_PORT_STRUCT* i2c_io ) const
{
	/* Enable serial clock pin for I2C */
	uC_IO_Config::Enable_Periph_Output_Pin( i2c_io->scl_port, true );
	Set_Bit( ( ( i2c_io->scl_port )->reg_ctrl )->OTYPER, ( i2c_io->scl_port )->pio_num );
	/* Enable serial data line for I2C */
	uC_IO_Config::Enable_Periph_Output_Pin( i2c_io->sda_port, true );
	Set_Bit( ( ( i2c_io->sda_port )->reg_ctrl )->OTYPER, ( i2c_io->sda_port )->pio_num );

}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F3xx_I2C::Initialize_Peripheral_Clock( const PERIPH_DEF_ST* periph_def ) const
{
	uC_Base::Reset_Periph( const_cast<PERIPH_DEF_ST*>( periph_def ) );
	uC_Base::Enable_Periph_Clock( const_cast<PERIPH_DEF_ST*>( periph_def ) );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
bool_t STM32F3xx_I2C::Clear_DMA_Interrupts()
{
	static const uint32_t dma_int_flags[] =
	{
		DMA_LISR_TCIF0 | DMA_LISR_HTIF0 | DMA_LISR_TEIF0 | DMA_LISR_DMEIF0
		| DMA_LISR_FEIF0,
		DMA_LISR_TCIF1 | DMA_LISR_HTIF1 | DMA_LISR_TEIF1 | DMA_LISR_DMEIF1
		| DMA_LISR_FEIF1,
		DMA_LISR_TCIF2 | DMA_LISR_HTIF2 | DMA_LISR_TEIF2 | DMA_LISR_DMEIF2
		| DMA_LISR_FEIF2,
		DMA_LISR_TCIF3 | DMA_LISR_HTIF3 | DMA_LISR_TEIF3 | DMA_LISR_DMEIF3
		| DMA_LISR_FEIF3,
		DMA_HISR_TCIF4 | DMA_HISR_HTIF4 | DMA_HISR_TEIF4 | DMA_HISR_DMEIF4
		| DMA_HISR_FEIF4,
		DMA_HISR_TCIF5 | DMA_HISR_HTIF5 | DMA_HISR_TEIF5 | DMA_HISR_DMEIF5
		| DMA_HISR_FEIF5,
		DMA_HISR_TCIF6 | DMA_HISR_HTIF6 | DMA_HISR_TEIF6 | DMA_HISR_DMEIF6
		| DMA_HISR_FEIF6,
		DMA_HISR_TCIF7 | DMA_HISR_HTIF7 | DMA_HISR_TEIF7 | DMA_HISR_DMEIF7
		| DMA_HISR_FEIF7
	};

