etn-electrical/JIVE_Client_Code/Babelfish/Babelfish/Code/uC/STM32F3xx/STM32F3xx_I2C.cpp
	uint32_t flag_settings;

	if ( m_rx_dma_id < 4U )
	{
		flag_settings = m_rx_dma_ctrl->LISR & dma_int_flags[m_rx_dma_id];
		m_rx_dma_ctrl->LIFCR |= dma_int_flags[m_rx_dma_id];
	}
	else
	{
		flag_settings = m_rx_dma_ctrl->HISR & dma_int_flags[m_rx_dma_id];
		m_rx_dma_ctrl->HIFCR |= dma_int_flags[m_rx_dma_id];
	}

	if ( m_tx_dma_id < 4U )
	{
		flag_settings = m_tx_dma_ctrl->LISR & dma_int_flags[m_tx_dma_id];
		m_tx_dma_ctrl->LIFCR |= dma_int_flags[m_tx_dma_id];
	}
	else
	{
		flag_settings = m_tx_dma_ctrl->HISR & dma_int_flags[m_tx_dma_id];
		m_tx_dma_ctrl->HIFCR |= dma_int_flags[m_tx_dma_id];
	}

	return ( ( true == static_cast<bool_t>( flag_settings & ( DMA_LISR_TEIF0 | DMA_LISR_DMEIF0 |
															  DMA_LISR_TEIF1 | DMA_LISR_DMEIF1 |
															  DMA_LISR_TEIF2 | DMA_LISR_DMEIF2 |
															  DMA_LISR_TEIF3 |
															  DMA_LISR_DMEIF3 ) ) ) ?
			 true : false );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F3xx_I2C::select_config_t::Configure( i2c_speed_mode_t i2c_mode,
												uint32_t i2c_pclk1_freq,
												duty_cycle_t fmode_duty_cycle,
												uint16_t byte_count_theshold )
{
	uint16_t i2c_ccr_value;
	uint16_t fast_mode_duty = 0U;

	i2c_cr1 = 0U;
	i2c_cr2 = 0U;
	dma_byte_count_theshold = byte_count_theshold;

	Set_Mask( i2c_cr2, I2C_CR2_FREQ, ( i2c_pclk1_freq / 1000000U ) );

	if ( I2C_FAST_SPEED == i2c_mode )
	{
		if ( DUTYCYCLE_FASTMODE_2 == fmode_duty_cycle )
		{
			i2c_ccr_value = static_cast<uint16_t>
				( i2c_pclk1_freq / ( I2C_ClockSpeed_400KHz * 3U ) );
			fast_mode_duty = static_cast<uint16_t>( 0x8000U );
		}
		else/* FASTMODE_DUTYCYCLE_16_9 */
		{
			i2c_ccr_value = static_cast<uint16_t>
				( i2c_pclk1_freq / ( I2C_ClockSpeed_400KHz * 25U ) );
			fast_mode_duty = static_cast<uint16_t>( 0xC000U );
		}
		if ( i2c_ccr_value < 1U )
		{
			/* Set minimum allowed value */
			i2c_ccr_value = 1U;
		}
		i2c_ccr = ( i2c_ccr_value | fast_mode_duty );
		i2c_trise = static_cast<uint16_t>( ( i2c_pclk1_freq * 3U ) / ( 10000000U ) ) + 1U;
		/*in fast mode, the maximum allowed SCL rise time is 300 ns */
	}
	else
	{
		i2c_ccr_value = static_cast<uint16_t>
			( ( i2c_pclk1_freq ) / ( I2C_ClockSpeed_100KHz << 1U ) );
		if ( i2c_ccr_value < 4U )
		{
			/* Set minimum allowed value */
			i2c_ccr_value = 4U;
		}
		i2c_ccr = i2c_ccr_value;
		i2c_trise = static_cast<uint16_t>( i2c_pclk1_freq / 1000000U ) + 1U;
		/*in standard mode, the maximum allowed SCL rise time is 1000 ns*/
	}

	i2c_cr1 |= I2C_CR1_ACK;	/* Acknowledge Enable */
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F3xx_I2C::Generate_Start( void )
{
	m_i2c->CR1 |= I2C_CR1_START;
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F3xx_I2C::Set_Stop( void )
{
	m_i2c->CR1 &= ( ~I2C_CR1_ACK );
	m_i2c->CR1 |= I2C_CR1_STOP;
	Nop();
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
uint16_t STM32F3xx_I2C::Get_SR1( void ) const
{
	return ( m_i2c->SR1 );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
uint16_t STM32F3xx_I2C::Get_SR2( void ) const
{
	return ( m_i2c->SR2 );
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F3xx_I2C::Wait_Flag_Timeout( uint32_t flag_mask ) const
{
	uint32_t timeout_count = static_cast<uint32_t>( PROCESSOR_FREQ_MHZ * I2C_TIMEOUT );

	while ( ( ( Get_SR1() & flag_mask ) == 0x00U ) && ( timeout_count > 0U ) )
	{
		__no_operation();
		timeout_count--;
	}
}

/*
 *****************************************************************************************
 * See header file for function definition.
 *****************************************************************************************
 */
void STM32F3xx_I2C::Bus_Busy_TimeOut( void )
{
	uint32_t timeout = static_cast<uint32_t>( PROCESSOR_FREQ_MHZ * 100U );

	while ( ( ( ( ( uint16_t )m_i2c->SR2 ) & I2C_SR2_BUSY ) != 0U ) && ( timeout > 0U ) )
	{
		__no_operation();
		timeout--;
	}
}
